[
  "table-editor-obsidian",
  "emoji-shortcodes",
  "obsidian-kanban",
  "highlightr-plugin",
  "obsidian-vimrc-support",
  "nldates-obsidian",
  "obsidian-list-callouts",
  "settings-search",
  "vim-yank-highlight",
  "callout-manager",
  "github-link",
  "obsidian42-brat",
  "obsidian-snippet-downloader",
  "dataview",
  "obsidian-icon-folder",
  "obsidian-tasks-plugin",
  "folder-notes",
  "quickadd",
  "obsidian-reminder-plugin",
  "obsidian-book-search-plugin",
  "note-refactor-obsidian",
  "cmdr",
  "obsidian-plantuml",
  "templater-obsidian",
  "auto-card-link",
  "metadata-menu",
  "chronology",
  "advanced-canvas",
  "morgen-tasks",
  "obsidian-meta-bind-plugin",
  "multi-column-markdown",
  "insta-toc",
  "obsidian-plugin-toc",
  "obsidian-footnotes",
  "tag-wrangler",
  "toggle-dark-mode",
  "obsidian-local-images-plus",
  "obsidian-dictionary-plugin",
  "juggl",
  "obsidian-minimal-settings",
  "ai-assistant",
  "obsidian-show-file-path",
  "epub-importer",
  "dbfolder",
  "sets",
  "obsidian-another-quick-switcher",
  "shukuchi",
  "obsidian-auto-link-title",
  "grappling-hook",
  "remember-cursor-position",
  "execute-code",
  "inline-admonitions",
  "editor-width-slider",
  "enhanced-annotations",
  "obsidian-hider"
]