[
  "table-editor-obsidian",
  "emoji-shortcodes",
  "obsidian-kanban",
  "multi-column-markdown",
  "highlightr-plugin",
  "obsidian-vimrc-support",
  "obsidian-excalidraw-plugin",
  "mermaid-tools",
  "nldates-obsidian",
  "obsidian-list-callouts",
  "settings-search",
  "vim-yank-highlight",
  "callout-manager",
  "obsidian-banners",
  "github-link",
  "obsidian-completr",
  "editor-width-slider",
  "obsidian42-brat",
  "obsidian-snippet-downloader",
  "dataview",
  "obsidian-icon-folder",
  "obsidian-day-planner",
  "obsidian-tasks-plugin",
  "folder-notes",
  "quickadd",
  "obsidian-reminder-plugin",
  "obsidian-book-search-plugin",
  "calendar",
  "note-refactor-obsidian",
  "wikipedia-search",
  "surfing",
  "perplexity-converter",
  "cmdr",
  "obsidian-plantuml",
  "templater-obsidian",
  "auto-card-link",
  "metadata-menu",
  "card-board"
]