[
  "table-editor-obsidian",
  "emoji-shortcodes",
  "obsidian-kanban",
  "highlightr-plugin",
  "obsidian-vimrc-support",
  "nldates-obsidian",
  "obsidian-list-callouts",
  "settings-search",
  "vim-yank-highlight",
  "callout-manager",
  "github-link",
  "obsidian-completr",
  "editor-width-slider",
  "obsidian42-brat",
  "obsidian-snippet-downloader",
  "dataview",
  "obsidian-icon-folder",
  "obsidian-tasks-plugin",
  "folder-notes",
  "quickadd",
  "obsidian-reminder-plugin",
  "obsidian-book-search-plugin",
  "note-refactor-obsidian",
  "surfing",
  "cmdr",
  "obsidian-plantuml",
  "templater-obsidian",
  "auto-card-link",
  "metadata-menu",
  "chronology",
  "advanced-canvas",
  "workspaces-plus",
  "morgen-tasks",
  "obsidian-meta-bind-plugin",
  "multi-column-markdown",
  "insta-toc",
  "obsidian-plugin-toc"
]