[
  "dataview",
  "obsidian-excalidraw-plugin",
  "emoji-shortcodes",
  "table-editor-obsidian",
  "obsidian-git",
  "obsidian-kanban",
  "obsidian-icon-folder",
  "obsidian-day-planner",
  "mermaid-tools",
  "nldates-obsidian",
  "highlightr-plugin",
  "settings-search"
]