[
  "dataview",
  "emoji-shortcodes",
  "table-editor-obsidian",
  "obsidian-kanban",
  "obsidian-day-planner",
  "nldates-obsidian",
  "highlightr-plugin",
  "settings-search",
  "chronology",
  "obsidian-list-callouts",
  "folder-notes",
  "quickadd",
  "obsidian-book-search-plugin",
  "obsidian-icon-folder",
  "surfing",
  "obsidian-completr",
  "obsidian-contextual-typography",
  "css-snippets",
  "obsidian-smart-typography",
  "obsidian-tasks-plugin",
  "github-link",
  "vim-yank-highlight",
  "obsidian-vimrc-support",
  "obsidian-reminder-plugin",
  "obsidian-media-db-plugin"
]