[
  "dataview",
  "obsidian-excalidraw-plugin",
  "emoji-shortcodes",
  "table-editor-obsidian",
  "obsidian-git",
  "obsidian-kanban",
  "obsidian-icon-folder",
  "obsidian-day-planner",
  "mermaid-tools",
  "nldates-obsidian",
  "highlightr-plugin",
  "settings-search",
  "chronology",
  "obsidian-list-callouts",
  "editor-width-slider",
  "vim-yank-highlight",
  "obsidian-banners",
  "obsidian-smart-typography",
  "obsidian-contextual-typography",
  "css-snippets",
  "github-link",
  "folder-notes",
  "obsidian-tasks-plugin",
  "various-complements"
]