[
  "dataview",
  "obsidian-tasks-plugin",
  "obsidian-kanban",
  "obsidian-icon-folder",
  "quickadd",
  "obsidian-annotator",
  "nldates-obsidian",
  "obsidian-importer",
  "highlightr-plugin",
  "obsidian-hider",
  "note-refactor-obsidian",
  "obsidian-auto-link-title",
  "obsidian-timeline",
  "obsidian-day-and-night",
  "obsidian-charts",
  "settings-search",
  "obsidian-list-callouts",
  "folder-notes",
  "chronology",
  "markwhen",
  "emoji-shortcodes",
  "obsidian-reminder-plugin",
  "obsidian-html-tags-autocomplete",
  "obsidian-completr",
  "obsidian-plugin-toc",
  "metadata-menu",
  "obsidian-projects",
  "obsidian-media-db-plugin",
  "advanced-canvas",
  "simple-canvasearch",
  "canvas-send-to-back",
  "surfing",
  "workspaces-plus",
  "morgen-tasks",
  "obsidian-dictionary-plugin",
  "vim-yank-highlight",
  "obsidian42-brat",
  "task-board",
  "obsidian-outliner"
]