[
  "dataview",
  "obsidian-tasks-plugin",
  "obsidian-icon-folder",
  "quickadd",
  "obsidian-annotator",
  "nldates-obsidian",
  "obsidian-importer",
  "highlightr-plugin",
  "note-refactor-obsidian",
  "obsidian-auto-link-title",
  "obsidian-timeline",
  "obsidian-day-and-night",
  "obsidian-charts",
  "settings-search",
  "obsidian-list-callouts",
  "folder-notes",
  "chronology",
  "markwhen",
  "emoji-shortcodes",
  "obsidian-reminder-plugin",
  "obsidian-completr",
  "obsidian-media-db-plugin",
  "advanced-canvas",
  "simple-canvasearch",
  "canvas-send-to-back",
  "workspaces-plus",
  "morgen-tasks",
  "obsidian42-brat",
  "obsidian-footnotes",
  "juggl",
  "templater-obsidian",
  "obsidian-vimrc-support",
  "obsidian-meta-bind-plugin",
  "obsidian-minimal-settings",
  "obsidian-style-settings",
  "callout-manager",
  "table-editor-obsidian",
  "obsidian-book-search-plugin",
  "github-link",
  "obsidian-latex-suite",
  "mathlive",
  "tabs",
  "sets",
  "obsidian-local-images-plus",
  "shukuchi",
  "grappling-hook",
  "obsidian-checklist-reset",
  "obsidian-another-quick-switcher",
  "remember-cursor-position",
  "inline-admonitions",
  "editor-width-slider",
  "execute-code",
  "enhanced-annotations",
  "automatic-table-of-contents",
  "insert-unsplash-image",
  "image-picker",
  "image-search",
  "obsidian-snippet-downloader",
  "chronos"
]